{
  "high": [
    "Delayed initiation of response actions increases the likelihood of broader impact in real incidents.",
    "Inconsistent escalation decisions create unpredictable incident outcomes and governance risk.",
    "Unclear decision authority can delay containment and increase business exposure.",
    "Weak governance alignment increases risk of delayed executive awareness and reporting timelines.",
    "Inadequate response consistency indicates outcomes may depend on who is on shift.",
    "Delayed response increases dwell time and reduces probability of early containment.",
    "Escalation triggers are not consistently understood across participants and roles.",
    "High reliance on guidance indicates playbooks and training are not sufficiently internalised.",
    "Delayed coordination increases the likelihood of fragmented incident handling in real conditions.",
    "Weak phase execution indicates material readiness gaps requiring immediate remediation.",
    "Inconsistent approvals and sign-offs indicate governance pathways are not robust.",
    "Lack of clear early action thresholds increases operational and regulatory risk.",
    "Decision delays in early stages can lead to avoidable spread and higher recovery cost.",
    "Insufficient governance readiness may impact regulatory reporting confidence and timelines.",
    "Response inconsistency indicates insufficient standardisation of incident handling behaviours.",
    "The observed delays suggest readiness does not meet expectations for high-severity BFSI incidents.",
    "The team’s early response behaviour indicates urgent need for process and training reinforcement.",
    "Governance and escalation gaps represent material risk for regulated incident response obligations.",
    "Low readiness in critical phases indicates significant improvement is required.",
    "The organisation should prioritise remediation to reduce incident impact and reporting risk."
  ],
  "medium": [
    "Response initiation is present but slower than expected; early action triggers should be reinforced.",
    "Execution quality is mixed, suggesting improvement is needed for consistent outcomes.",
    "Participants demonstrated partial role clarity; escalation authority should be clarified.",
    "Some dependence on guidance indicates training reinforcement opportunities.",
    "Containment actions were taken but not consistently early; decision-to-action speed should improve.",
    "Coordination behaviours indicate partial readiness with opportunities for stronger structure.",
    "Phase performance varies across participants, indicating inconsistent operational discipline.",
    "Some delays suggest decision confidence could be strengthened through targeted drills.",
    "The team demonstrates baseline capability but requires improvement for reliability under pressure.",
    "Moderate governance alignment suggests policy checkpoints need clearer operational translation.",
    "Response consistency can be improved by standardising early response and escalation steps.",
    "Outcomes indicate capability exists but requires further maturity building.",
    "Operational readiness is developing; repeat exercises should track improvement over time.",
    "Some gaps suggest playbooks may not be sufficiently actionable at shift level.",
    "Moderate performance indicates improvement is needed in early-stage decision discipline.",
    "The observed patterns suggest readiness can be improved with structured training and practice.",
    "The team’s performance indicates partial readiness with clear improvement opportunities.",
    "Moderate dependence on guidance suggests uneven confidence across participants.",
    "The organisation has baseline readiness but should strengthen governance alignment.",
    "Improvement is required to ensure consistent, repeatable incident response outcomes."
  ],
  "low": [
    "The team demonstrates solid readiness in this area with limited improvement required.",
    "Performance suggests processes are functioning effectively and consistently.",
    "Observed behaviour indicates good alignment with expected incident handling practices.",
    "The team demonstrated reliable execution with minimal operational friction.",
    "Readiness appears stable and consistent across participants in this area.",
    "Outcomes indicate the organisation is better prepared for real incident conditions in this domain.",
    "This area shows strong maturity relative to other phases and should be maintained.",
    "Performance indicates good role clarity and disciplined execution.",
    "Observed results suggest the team can sustain this capability during real incidents.",
    "Execution is consistent and aligned with expected incident response behaviours.",
    "The team shows strong readiness here, with limited corrective action required.",
    "Readiness appears well embedded; focus should remain on maintaining this standard.",
    "This capability is stable and supports overall incident response effectiveness.",
    "The team demonstrated effective execution with minimal need for remediation.",
    "Outcomes indicate strong operational readiness and good process adherence.",
    "This area shows good maturity and should be used as a benchmark for other phases.",
    "Observed behaviour indicates strong preparedness and consistent decision-making.",
    "Performance reflects reliable capability under the exercise conditions.",
    "The organisation shows good readiness here and should continue periodic validation.",
    "This domain demonstrates strength and should be sustained through continued drills."
  ]
}
