{
  "strong": [
    "The team delivered high-quality actions aligned with expected incident response outcomes.",
    "Execution quality indicates strong understanding of expected response steps.",
    "The team consistently produced correct and complete responses across key tasks.",
    "Observed outcomes reflect strong capability effectiveness during the exercise.",
    "Response quality indicates disciplined execution under simulated pressure.",
    "Actions taken were largely correct and aligned with scenario expectations.",
    "The team demonstrated reliable capability in performing required incident tasks.",
    "Quality of execution suggests good operational preparedness and skill alignment.",
    "The team completed key actions with strong accuracy and completeness.",
    "Execution outcomes indicate strong readiness to follow response playbooks.",
    "Response quality indicates reliable operational behaviour for real incident conditions.",
    "The team’s actions reflect strong alignment with expected incident handling standards.",
    "High-quality response indicates mature execution capability within the team.",
    "The team performed consistently well across response requirements.",
    "Observed outputs reflect strong incident response proficiency for BFSI contexts.",
    "The quality of response actions suggests good training retention and application.",
    "Strong execution outcomes indicate effective operational discipline and decision quality.",
    "The team demonstrated high correctness in addressing scenario requirements.",
    "Response quality suggests strong preparedness for real-world incident execution demands.",
    "The team delivered strong results, indicating reliable response capability."
  ],
  "moderate": [
    "The team achieved partial success, with quality varying across tasks and participants.",
    "Response quality was mixed, indicating strengths but also noticeable execution gaps.",
    "The team completed several actions correctly but not consistently across all areas.",
    "Execution quality indicates baseline capability with improvement required for reliability.",
    "The team demonstrated partial alignment with expected incident response outcomes.",
    "Observed performance suggests adequate skills but inconsistent application under pressure.",
    "Response outputs indicate moderate readiness with uneven execution quality.",
    "The team performed key tasks but with gaps in completeness or correctness.",
    "Quality levels varied, suggesting the need for reinforced playbook-based training.",
    "The team achieved moderate effectiveness, with improvement needed in critical steps.",
    "Execution indicates the team can respond, but outcomes are not consistently dependable.",
    "Response quality suggests partial readiness and opportunities for capability strengthening.",
    "The team’s performance indicates moderate capability effectiveness with gaps to address.",
    "Some actions were correct; others indicate uncertainty around expected response steps.",
    "Quality of results suggests role clarity and decision discipline require strengthening.",
    "Moderate outcomes indicate improvement needed in accuracy and completeness.",
    "The team demonstrated baseline competence but lacked consistent high-quality execution.",
    "Response results indicate capability exists but is not stable across all scenarios.",
    "Execution outcomes were moderate, indicating need for structured practice and reinforcement.",
    "The team’s performance reflects partial readiness with noticeable improvement areas."
  ],
  "weak": [
    "The team’s execution quality was low, indicating significant readiness gaps.",
    "Observed outcomes indicate the team struggled to deliver correct and complete responses.",
    "Response quality was consistently below expectations for BFSI-grade incident handling.",
    "The team did not consistently complete required response actions effectively.",
    "Execution results indicate insufficient preparedness to handle similar real incidents.",
    "Low effectiveness suggests gaps in training, playbook familiarity, and decision-making.",
    "The quality of actions indicates weak operational capability under incident pressure.",
    "Responses were incomplete or incorrect across several core requirements.",
    "Observed performance indicates the team is not yet ready for reliable incident execution.",
    "Low-quality outputs indicate a need for targeted capability development and drills.",
    "Execution gaps suggest uncertainty about what actions are required during incidents.",
    "The team struggled to meet expected response standards, increasing operational risk.",
    "Weak outcomes indicate significant improvement is required in response execution discipline.",
    "Performance indicates the team would face challenges containing a real-world incident quickly.",
    "Low effectiveness suggests inadequate alignment with expected incident response workflows.",
    "The team’s actions indicate limited readiness to perform critical response steps.",
    "Weak execution indicates high risk of delayed containment and extended recovery timelines.",
    "Outcomes suggest playbooks and role-based responsibilities are not well internalised.",
    "The team showed low consistency and correctness, indicating major preparedness gaps.",
    "The response quality indicates immediate remediation is required to reduce incident risk."
  ]
}
